In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

### 2.11

In [4]:
ratings = pd.read_csv('ml-1m/ratings.dat',
                      sep='\n',
                      delimiter='::',
                      header=None,
                      names=['UserID', 'MovieID','Rating','Timestamp'],
                      engine='python')

In [5]:
movies = pd.read_csv('ml-1m/movies.dat',sep='\n',
                     delimiter='::',
                     header=None, 
                     names=['MovieID', 'Title','Genres'], 
                     engine='python')

In [6]:
users = pd.read_csv('ml-1m/users.dat',sep='\n',
                     delimiter='::',
                     header=None, 
                     names=['UserID', 'Gender','Age', 'Occupation','Zip-code'], 
                     engine='python')

In [7]:
users.head()

   UserID Gender  Age  Occupation Zip-code
0       1      F    1          10    48067
1       2      M   56          16    70072
2       3      M   25          15    55117
3       4      M   45           7    02460
4       5      M   25          20    55455

In [8]:
movies.head()

   MovieID                               Title                        Genres
0        1                    Toy Story (1995)   Animation|Children's|Comedy
1        2                      Jumanji (1995)  Adventure|Children's|Fantasy
2        3             Grumpier Old Men (1995)                Comedy|Romance
3        4            Waiting to Exhale (1995)                  Comedy|Drama
4        5  Father of the Bride Part II (1995)                        Comedy

In [9]:
ratings.head()

   UserID  MovieID  Rating  Timestamp
0       1     1193       5  978300760
1       1      661       3  978302109
2       1      914       3  978301968
3       1     3408       4  978300275
4       1     2355       5  978824291

In [10]:
movies.set_index("MovieID")
movies.head()

   MovieID                               Title                        Genres
0        1                    Toy Story (1995)   Animation|Children's|Comedy
1        2                      Jumanji (1995)  Adventure|Children's|Fantasy
2        3             Grumpier Old Men (1995)                Comedy|Romance
3        4            Waiting to Exhale (1995)                  Comedy|Drama
4        5  Father of the Bride Part II (1995)                        Comedy

In [11]:
movies[["Title", "Year"]] = movies.Title.str.extract(r"(.*) \((\d{4})\)")

movies.head()

/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: currently extract(expand=None) means expand=False (return Index/Series/DataFrame) but in a future version of pandas this will be changed to expand=True (return DataFrame)
  """Entry point for launching an IPython kernel.

   MovieID                        Title                        Genres  Year
0        1                    Toy Story   Animation|Children's|Comedy  1995
1        2                      Jumanji  Adventure|Children's|Fantasy  1995
2        3             Grumpier Old Men                Comedy|Romance  1995
3        4            Waiting to Exhale                  Comedy|Drama  1995
4        5  Father of the Bride Part II                        Comedy  1995

In [12]:
movies['MovieID'].count()

3883

In [13]:
movies['Year']  = movies['Year'].astype(int)

In [14]:
countByYear = movies.groupby('Year').count()
countByYear.head()

      MovieID  Title  Genres
Year
1919        3      3       3
1920        2      2       2
1921        1      1       1
1922        2      2       2
1923        3      3       3

In [15]:
countByYear = movies.Year.value_counts(sort=True)
countByYear.head()

1996    345
1995    342
1998    337
1997    315
1999    283
Name: Year, dtype: int64

In [16]:
sexRatio = pd.crosstab(users.Gender, users.Age)
sexRatio

Age      1    18    25   35   45   50   56
Gender
F        78  298   558  338  189  146  102
M       144  805  1538  855  361  350  278

In [17]:
allGenresAccurances = pd.Series(np.concatenate(movies.Genres.str.split('|'), axis=0))
allGenresAccurances.columns = ['Genre']
allGenresAccurances.value_counts(sort=True)

Drama          1603
Comedy         1200
Action          503
Thriller        492
Romance         471
Horror          343
Adventure       283
Sci-Fi          276
Children's      251
Crime           211
War             143
Documentary     127
Musical         114
Mystery         106
Animation       105
Western          68
Fantasy          68
Film-Noir        44
dtype: int64

In [20]:
ratings_by_movie = pd.merge(movies,ratings, left_index = True, right_on="MovieID").groupby('Title').mean()['Rating'].sort_values(ascending=False)
ratings_by_movie = ratings_by_movie.reset_index()
ratings_by_movie.head()

                    Title  Rating
0  Perils of Pauline, The     5.0
1        Beautiful People     5.0
2       Cup, The (Ph�rpa)     5.0
3            American Pop     5.0
4   Passion in the Desert     5.0

In [22]:
ratings_count = pd.merge(movies,ratings, left_index=True,right_on='MovieID').groupby('Title').count()['Rating'] 
movies_with_100_ratings = pd.Series(ratings_count[ratings_count > 100]).reset_index()

pd.merge(movies_with_100_ratings,ratings_by_movie, on='Title').sort_values('Rating_y', ascending=False).head()

                                             Title  Rating_x  Rating_y
1369                                        Popeye       628  4.560510
1692  Strawberry and Chocolate (Fresa y chocolate)      2227  4.554558
941                                    Kansas City      2223  4.524966
959                                            Kim       657  4.520548
746                                 Guardian Angel      1783  4.517106

In [36]:
user_ratings = pd.merge(users.set_index('UserID'),ratings, left_index=True, right_on='UserID').set_index('MovieID')
user_ratings.head()

        Gender  Age  Occupation Zip-code  UserID  Rating  Timestamp
MovieID
1193         F    1          10    48067       1       5  978300760
661          F    1          10    48067       1       3  978302109
914          F    1          10    48067       1       3  978301968
3408         F    1          10    48067       1       4  978300275
2355         F    1          10    48067       1       5  978824291

In [62]:
user_ratings_movies = pd.merge(user_ratings, movies, left_index=True, right_on='MovieID')
best_movies_by_gender = user_ratings_movies.groupby(['Gender', 'Title']).agg(['mean', 'count'])['Rating']
best_movies_by_gender = best_movies_by_gender[best_movies_by_gender['count'] > 100]
best_movies_by_gender.reset_index().sort_values(by=['mean','Gender'], ascending=False).drop_duplicates(['Gender'])

     Gender           Title      mean  count
162       F  Close Shave, A  4.644444    180
1450      M  Godfather, The  4.583333   1740

In [76]:
mean_year_by_age = user_ratings_movies.groupby(['Age']).agg(['mean'])['Year']
np.round(mean_movies_by_age)

       mean
Age
1    1989.0
18   1990.0
25   1988.0
35   1985.0
45   1984.0
50   1982.0
56   1982.0

In [89]:
user_ratings_movies_female = user_ratings_movies[user_ratings_movies['Gender'] == 'F']
user_ratings_movies_male = user_ratings_movies[user_ratings_movies['Gender'] == 'M']

print(pd.Series(user_ratings_movies_female.Genres.str.split(pat = '|', expand=True).values.ravel()).describe().iloc[2])
print(pd.Series(user_ratings_movies_male.Genres.str.split(pat = '|', expand=True).values.ravel()).describe().iloc[2])

Drama
Comedy

# 2.10

In [104]:
import os

In [105]:
import sqlite3

In [124]:
flights = pd.read_csv('nycflights13_flights.csv.gz',
                      comment ='#',
                      engine='python')

In [110]:
planes = pd.read_csv('nycflights13_planes.csv.gz',
                      comment ='#',
                      engine='python')

In [111]:
weather = pd.read_csv('nycflights13_weather.csv.gz',
                      comment ='#',
                      engine='python')

In [113]:
airports = pd.read_csv('nycflights13_airports.csv.gz',
                      comment ='#',
                      engine='python')

In [116]:
airlines = pd.read_csv('nycflights13_airlines.csv.gz',
                      comment ='#',
                      engine='python')

In [128]:
db_name = 'nycflights13.db'
os.remove(os.path.join(os.getcwd(), db_name))

In [129]:
db_name = 'nycflights13.db'
con = sqlite3.connect(os.path.join(os.getcwd(), db_name))
planes.to_sql('planes', con);
flights.to_sql('flights', con);
airlines.to_sql('airlines', con);
weather.to_sql('weather', con);
airports.to_sql('airports', con);

In [133]:
for row in con.execute('SELECT DISTINCT engine FROM planes'):
    print(row)

('Turbo-fan',)
('Turbo-jet',)
('Reciprocating',)
('4 Cycle',)
('Turbo-shaft',)
('Turbo-prop',)

In [136]:
for row in con.execute('Select distinct type,manufacturer,model,seats,engine From planes'):
    print(row)

('Fixed wing multi engine', 'EMBRAER', 'EMB-145XR', 55, 'Turbo-fan')
('Fixed wing multi engine', 'AIRBUS INDUSTRIE', 'A320-214', 182, 'Turbo-fan')
('Fixed wing multi engine', 'EMBRAER', 'EMB-145LR', 55, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '737-824', 149, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '767-332', 330, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '757-224', 178, 'Turbo-jet')
('Fixed wing multi engine', 'AIRBUS', 'A320-214', 182, 'Turbo-fan')
('Fixed wing multi engine', 'BOMBARDIER INC', 'CL-600-2D24', 95, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '737-724', 149, 'Turbo-jet')
('Fixed wing multi engine', 'BOEING', '737-524', 149, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '767-3P6', 290, 'Turbo-fan')
('Fixed wing multi engine', 'AIRBUS', 'A321-211', 199, 'Turbo-fan')
('Fixed wing multi engine', 'AIRBUS INDUSTRIE', 'A321-211', 199, 'Turbo-jet')
('Fixed wing multi engine', 'BOEING', '737-76N', 149, 'Turbo-fan')
('Fixed wing multi engine', 'EMBRAER', 'ERJ 190-100 IGW', 20, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '737-7H4', 140, 'Turbo-fan')
('Fixed wing single engine', 'CESSNA', '150', 2, 'Reciprocating')
('Fixed wing multi engine', 'CESSNA', '421C', 8, 'Reciprocating')
('Fixed wing multi engine', 'BOEING', '777-222', 400, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '787-8', 260, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '767-201', 255, 'Turbo-jet')
('Fixed wing multi engine', 'BOEING', '737-705', 149, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '777-200', 400, 'Turbo-jet')
('Fixed wing multi engine', 'BOEING', '737-924ER', 191, 'Turbo-fan')
('Fixed wing multi engine', 'EMBRAER', 'EMB-145', 55, 'Turbo-jet')
('Fixed wing multi engine', 'AIRBUS INDUSTRIE', 'A340-313', 375, 'Turbo-jet')
('Fixed wing multi engine', 'BOEING', '737-732', 149, 'Turbo-fan')
('Fixed wing multi engine', 'AIRBUS INDUSTRIE', 'A319-114', 145, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '737-990', 149, 'Turbo-jet')
('Fixed wing multi engine', 'BOEING', '737-924', 191, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '737-7BD', 149, 'Turbo-fan')
('Fixed wing multi engine', 'AIRBUS INDUSTRIE', 'A320-211', 182, 'Turbo-jet')
('Fixed wing single engine', 'JOHN G HESS', 'AT-5', 2, '4 Cycle')
('Fixed wing multi engine', 'BOEING', '737-3Q8', 149, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '767-223', 255, 'Turbo-fan')
('Fixed wing multi engine', 'AIRBUS INDUSTRIE', 'A320-212', 182, 'Turbo-fan')
('Fixed wing multi engine', 'AIRBUS', 'A319-114', 145, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '737-3K2', 149, 'Turbo-jet')
('Fixed wing multi engine', 'GULFSTREAM AEROSPACE', 'G-IV', 22, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '737-3H4', 149, 'Turbo-fan')
('Rotorcraft', 'SIKORSKY', 'S-76A', 14, 'Turbo-shaft')
('Fixed wing multi engine', 'PIPER', 'PA-31-350', 8, 'Reciprocating')
('Fixed wing multi engine', 'BOEING', '767-323', 330, 'Turbo-fan')
('Fixed wing multi engine', 'CESSNA', '310Q', 6, 'Reciprocating')
('Rotorcraft', 'AGUSTA SPA', 'A109E', 8, 'Turbo-shaft')
('Fixed wing multi engine', 'BOMBARDIER INC', 'CL-600-2C10', 80, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '737-832', 189, 'Turbo-jet')
('Fixed wing multi engine', 'AIRBUS', 'A320-212', 182, 'Turbo-fan')
('Fixed wing single engine', 'PIPER', 'PA-32RT-300', 7, 'Reciprocating')
('Fixed wing multi engine', 'BOEING', '737-832', 189, 'Turbo-fan')
('Fixed wing single engine', 'PAIR MIKE E', 'FALCON XP', 2, 'Reciprocating')
('Fixed wing multi engine', 'AIRBUS', 'A320-211', 182, 'Turbo-fan')
('Fixed wing single engine', 'CESSNA', '172E', 4, 'Reciprocating')
('Fixed wing multi engine', 'AIRBUS', 'A330-243', 377, 'Turbo-fan')
('Fixed wing multi engine', 'DOUGLAS', 'DC-7BF', 102, 'Reciprocating')
('Fixed wing multi engine', 'BEECH', 'E-90', 10, 'Turbo-prop')
('Rotorcraft', 'BELL', '230', 11, 'Turbo-shaft')
('Fixed wing single engine', 'AVIAT AIRCRAFT INC', 'A-1B', 2, 'Reciprocating')
('Fixed wing multi engine', 'BOEING', '767-324', 269, 'Turbo-fan')
('Fixed wing single engine', 'STEWART MACO', 'FALCON XP', 2, 'Reciprocating')
('Fixed wing multi engine', 'LEARJET INC', '60', 11, 'Turbo-fan')
('Fixed wing multi engine', 'AIRBUS INDUSTRIE', 'A320-232', 200, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '737-990ER', 222, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '737-401', 149, 'Turbo-jet')
('Fixed wing multi engine', 'MCDONNELL DOUGLAS', 'DC-9-82(MD-82)', 172, 'Turbo-fan')
('Fixed wing single engine', 'PIPER', 'PA-28-180', 4, 'Reciprocating')
('Fixed wing multi engine', 'BOMBARDIER INC', 'CL-600-2B19', 55, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '737-4B7', 149, 'Turbo-fan')
('Fixed wing multi engine', 'MCDONNELL DOUGLAS', 'DC-9-83(MD-83)', 172, 'Turbo-fan')
('Fixed wing multi engine', 'AIRBUS', 'A320-232', 200, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '757-251', 178, 'Turbo-jet')
('Fixed wing multi engine', 'BOEING', '757-222', 178, 'Turbo-jet')
('Fixed wing multi engine', 'BOEING', '737-5H4', 149, 'Turbo-jet')
('Fixed wing multi engine', 'BOEING', '737-890', 149, 'Turbo-fan')
('Fixed wing multi engine', 'AIRBUS', 'A321-231', 379, 'Turbo-fan')
('Rotorcraft', 'BELL', '206B', 5, 'Turbo-shaft')
('Fixed wing single engine', 'CIRRUS DESIGN CORP', 'SR22', 4, 'Reciprocating')
('Fixed wing single engine', 'HURLEY JAMES LARRY', 'FALCON-XP', 2, 'Reciprocating')
('Fixed wing multi engine', 'CESSNA', '550', 8, 'Turbo-fan')
('Fixed wing single engine', 'CESSNA', 'A185F', 6, 'Reciprocating')
('Fixed wing single engine', 'KILDALL GARY', 'FALCON-XP', 2, 'Reciprocating')
('Fixed wing single engine', 'STEWART MACO', 'FALCON-XP', 2, 'Reciprocating')
('Fixed wing multi engine', 'AIRBUS', 'A319-115', 147, 'Turbo-fan')
('Fixed wing multi engine', 'AIRBUS', 'A319-112', 100, 'Turbo-fan')
('Fixed wing single engine', 'LAMBERT RICHARD', 'FALCON XP', 2, 'Reciprocating')
('Fixed wing single engine', 'BARKER JACK L', 'ZODIAC 601HDS', 2, 'Reciprocating')
('Fixed wing single engine', 'AMERICAN AIRCRAFT INC', 'FALCON XP', 2, 'Reciprocating')
('Rotorcraft', 'ROBINSON HELICOPTER CO', 'R66', 5, 'Turbo-shaft')
('Fixed wing single engine', 'FRIEDEMANN JON', 'VANS AIRCRAFT RV6', 2, 'Reciprocating')
('Fixed wing single engine', 'PIPER', 'PA-32R-300', 7, 'Reciprocating')
('Fixed wing multi engine', 'BOEING', '737-8FH', 149, 'Turbo-jet')
('Fixed wing multi engine', 'BOEING', '737-76Q', 149, 'Turbo-fan')
('Fixed wing single engine', 'LEBLANC GLENN T', 'FALCON XP', 2, 'Reciprocating')
('Fixed wing multi engine', 'BOEING', '737-7BX', 149, 'Turbo-fan')
('Fixed wing single engine', 'MARZ BARRY', 'KITFOX IV', 2, 'Reciprocating')
('Fixed wing single engine', 'DEHAVILLAND', 'OTTER DHC-3', 16, 'Reciprocating')
('Fixed wing multi engine', 'BOEING', '757-324', 275, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '777-224', 400, 'Turbo-fan')
('Fixed wing multi engine', 'AIRBUS INDUSTRIE', 'A321-231', 379, 'Turbo-fan')
('Fixed wing single engine', 'CESSNA', '210-5(205)', 6, 'Reciprocating')
('Fixed wing multi engine', 'BOEING', '757-33N', 275, 'Turbo-jet')
('Fixed wing multi engine', 'BOEING', '757-351', 275, 'Turbo-jet')
('Fixed wing multi engine', 'BOEING', '767-424ER', 292, 'Turbo-jet')
('Fixed wing multi engine', 'MCDONNELL DOUGLAS', 'DC-9-51', 139, 'Turbo-jet')
('Fixed wing multi engine', 'BOEING', '757-232', 178, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '717-200', 100, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '757-223', 178, 'Turbo-fan')
('Fixed wing multi engine', 'BEECH', '65-A90', 9, 'Turbo-prop')
('Fixed wing single engine', 'CESSNA', '172M', 4, '4 Cycle')
('Fixed wing multi engine', 'AIRBUS INDUSTRIE', 'A320-231', 182, 'Turbo-jet')
('Fixed wing multi engine', 'BOEING', '757-2Q8', 178, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '767-322', 330, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '737-3L9', 149, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '737-301', 149, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '737-3Y0', 149, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '737-3A4', 149, 'Turbo-jet')
('Fixed wing multi engine', 'BOEING', '737-3G7', 149, 'Turbo-jet')
('Fixed wing multi engine', 'BOEING', '747-451', 450, 'Turbo-jet')
('Fixed wing multi engine', 'BOEING', '767-224', 255, 'Turbo-jet')
('Fixed wing multi engine', 'BOEING', '737-3TO', 149, 'Turbo-jet')
('Fixed wing multi engine', 'BOEING', '737-317', 149, 'Turbo-jet')
('Fixed wing multi engine', 'BOEING', '737-3T5', 149, 'Turbo-jet')
('Fixed wing multi engine', 'AIRBUS INDUSTRIE', 'A319-112', 179, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '757-231', 178, 'Turbo-fan')
('Fixed wing multi engine', 'GULFSTREAM AEROSPACE', 'G1159B', 22, 'Turbo-jet')
('Fixed wing single engine', 'CESSNA', '172N', 4, 'Reciprocating')
('Fixed wing multi engine', 'BOEING', '757-212', 178, 'Turbo-jet')
('Fixed wing multi engine', 'BOEING', '737-7AD', 128, 'Turbo-jet')
('Fixed wing multi engine', 'BOEING', '737-7Q8', 149, 'Turbo-fan')
('Fixed wing multi engine', 'AIRBUS INDUSTRIE', 'A319-132', 179, 'Turbo-jet')
('Fixed wing multi engine', 'AIRBUS INDUSTRIE', 'A319-131', 179, 'Turbo-jet')
('Fixed wing multi engine', 'AIRBUS', 'A330-323', 379, 'Turbo-fan')
('Fixed wing multi engine', 'CANADAIR', 'CL-600-2B19', 55, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '767-432ER', 300, 'Turbo-jet')
('Fixed wing multi engine', 'BOEING', '737-8H4', 140, 'Turbo-fan')
('Fixed wing multi engine', 'AIRBUS', 'A319-132', 179, 'Turbo-fan')
('Fixed wing multi engine', 'CANADAIR LTD', 'CF-5D', 2, 'Turbo-jet')
('Fixed wing multi engine', 'AIRBUS INDUSTRIE', 'A330-223', 379, 'Turbo-jet')
('Fixed wing multi engine', 'AIRBUS', 'A319-131', 179, 'Turbo-jet')
('Fixed wing multi engine', 'AIRBUS', 'A330-223', 379, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '777-232', 400, 'Turbo-jet')
('Fixed wing multi engine', 'MCDONNELL DOUGLAS CORPORATION', 'MD-88', 142, 'Turbo-jet')
('Fixed wing multi engine', 'BOEING', '757-26D', 178, 'Turbo-jet')
('Fixed wing multi engine', 'MCDONNELL DOUGLAS', 'MD-90-30', 142, 'Turbo-jet')
('Fixed wing multi engine', 'MCDONNELL DOUGLAS AIRCRAFT CO', 'MD-88', 142, 'Turbo-fan')
('Fixed wing multi engine', 'AVIONS MARCEL DASSAULT', 'MYSTERE FALCON 900', 12, 'Turbo-fan')
('Fixed wing multi engine', 'MCDONNELL DOUGLAS', 'MD-90-30', 142, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', 'MD-90-30', 142, 'Turbo-fan')
('Fixed wing multi engine', 'BOEING', '757-2B7', 178, 'Turbo-fan')

In [137]:
for row in con.execute('Select count(*), engine from planes group by engine'):
    print(row)

(2, '4 Cycle')
(28, 'Reciprocating')
(2750, 'Turbo-fan')
(535, 'Turbo-jet')
(2, 'Turbo-prop')
(5, 'Turbo-shaft')

In [138]:
for row in con.execute('Select count(*), engine, type from planes group by engine,type'):
    print(row)

(2, '4 Cycle', 'Fixed wing single engine')
(5, 'Reciprocating', 'Fixed wing multi engine')
(23, 'Reciprocating', 'Fixed wing single engine')
(2750, 'Turbo-fan', 'Fixed wing multi engine')
(535, 'Turbo-jet', 'Fixed wing multi engine')
(2, 'Turbo-prop', 'Fixed wing multi engine')
(5, 'Turbo-shaft', 'Rotorcraft')

In [141]:
sql_result = pd.read_sql_query('SELECT MIN(year), AVG(year), MAX(year), engine, manufacturer FROM planes GROUP BY engine, manufacturer', con)
sql_result

,MIN(year),AVG(year),MAX(year),engine,manufacturer
0,1975.0,1975.000000,1975.0,4 Cycle,CESSNA
1,NaN,NaN,NaN,4 Cycle,JOHN G HESS
2,NaN,NaN,NaN,Reciprocating,AMERICAN AIRCRAFT INC
3,2007.0,2007.000000,2007.0,Reciprocating,AVIAT AIRCRAFT INC
4,NaN,NaN,NaN,Reciprocating,BARKER JACK L
5,1959.0,1971.142857,1983.0,Reciprocating,CESSNA
6,2007.0,2007.000000,2007.0,Reciprocating,CIRRUS DESIGN CORP
7,1959.0,1959.000000,1959.0,Reciprocating,DEHAVILLAND
8,1956.0,1956.000000,1956.0,Reciprocating,DOUGLAS
9,2007.0,2007.000000,2007.0,Reciprocating,FRIEDEMANN JON
10,NaN,NaN,NaN,Reciprocating,HURLEY JAMES LARRY
11,1985.0,1985.000000,1985.0,Reciprocating,KILDALL GARY
12,NaN,NaN,NaN,Reciprocating,LAMBERT RICHARD
13,1985.0,1985.000000,1985.0,Reciprocating,LEBLANC GLENN T
14,1993.0,1993.000000,1993.0,Reciprocating,MARZ BARRY
15,NaN,NaN,NaN,Reciprocating,PAIR MIKE E
16,1968.0,1976.400000,1980.0,Reciprocating,PIPER
17,1985.0,1985.000000,1985.0,Reciprocating,STEWART MACO
18,2002.0,2007.281734,2013.0,Turbo-fan,AIRBUS
19,1992.0,1998.599251,2013.0,Turbo-fan,AIRBUS INDUSTRIE
20,1986.0,1986.000000,1986.0,Turbo-fan,AVIONS MARCEL DASSAULT
21,1965.0,2001.210400,2013.0,Turbo-fan,BOEING
22,1998.0,2004.486188,2013.0,Turbo-fan,BOMBARDIER INC
23,1997.0,1997.333333,1998.0,Turbo-fan,CANADAIR
24,1979.0,1979.000000,1979.0,Turbo-fan,CESSNA
25,1998.0,2003.613014,2013.0,Turbo-fan,EMBRAER
26,1992.0,1992.000000,1992.0,Turbo-fan,GULFSTREAM AEROSPACE
27,NaN,NaN,NaN,Turbo-fan,LEARJET INC
28,1986.0,1989.704545,1997.0,Turbo-fan,MCDONNELL DOUGLAS
29,1987.0,1989.737864,1993.0,Turbo-fan,MCDONNELL DOUGLAS AIRCRAFT CO
30,2002.0,2002.000000,2002.0,Turbo-jet,AIRBUS
31,1989.0,1997.439024,2004.0,Turbo-jet,AIRBUS INDUSTRIE
32,1984.0,1996.368272,2005.0,Turbo-jet,BOEING
33,1974.0,1974.000000,1974.0,Turbo-jet,CANADAIR LTD
34,1999.0,1999.000000,1999.0,Turbo-jet,EMBRAER
35,1976.0,1976.000000,1976.0,Turbo-jet,GULFSTREAM AEROSPACE
36,1975.0,1990.714286,1998.0,Turbo-jet,MCDONNELL DOUGLAS
37,1991.0,1991.928571,1992.0,Turbo-jet,MCDONNELL DOUGLAS CORPORATION
38,1967.0,1969.500000,1972.0,Turbo-prop,BEECH
39,2001.0,2001.000000,2001.0,Turbo-shaft,AGUSTA SPA
40,1975.0,1984.500000,1994.0,Turbo-shaft,BELL
41,2012.0,2012.000000,2012.0,Turbo-shaft,ROBINSON HELICOPTER CO
42,1985.0,1985.000000,1985.0,Turbo-shaft,SIKORSKY